Revit 2024 API
BuiltInFailures.ParameterFailures.InconsistentSharedParameterDefinitions Property
 The shared parameter '...' cannot be added with name '...' and type '...' because it conflicts with the existing name '...' and type '...'.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InconsistentSharedParameterDefinitions { get; }
Visual Basic
Public Shared ReadOnly Property InconsistentSharedParameterDefinitions As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InconsistentSharedParameterDefinitions {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ParameterFailures Class
Autodesk.Revit.DB Namespace